# Задача 0: Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).

# Например:
# 4 -> 16
# -3 -> 9
# -7 -> 49

num = int(input("Введите число: "))
print(f"Квадрат числа {num} = {num * num}")
